-- Source: https://docs.google.com/spreadsheets/d/1WyNDNZKVG9s1BCbJPYhQKooq7Bf_Qn-n/edit?gid=1753773719
-- Sheet: รหัสหมวดของค่าบริการ
SET NAMES utf8mb3;
SET FOREIGN_KEY_CHECKS=0;

DROP TABLE IF EXISTS `c_chargeitem`;
CREATE TABLE `c_chargeitem` (
  `code` varchar(2) NOT NULL,
  `chargeitem_name` varchar(255) NOT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT 1,
  PRIMARY KEY (`code`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

INSERT INTO `c_chargeitem` (`code`, `chargeitem_name`) VALUES
('01', 'ค่าห้องและค่าอาหาร'),
('02', 'ค่าอวัยวะเทียมและอุปกรณ์ในการบำบัดรักษาโรค'),
('03', 'ค่ายาและสารอาหารทางเส้นเลือด (ยาในบัญชียาหลักแห่งชาติ)'),
('04', 'ค่ายากลับบ้าน'),
('05', 'ค่าเวชภัณฑ์ที่มิใช่ยา'),
('06', 'ค่าบริการโลหิตและส่วนประกอบของโลหิต'),
('07', 'ค่าตรวจวินิจฉัยทางเทคนิคการแพทย์และพยาธิวิทยา'),
('08', 'ค่าตรวจวินิจฉัยและรักษาทางรังสีวิทยา'),
('09', 'ค่าตรวจวินิฉัยโดยวิธีพิเศษอื่นๆ'),
('10', 'ค่าอุปกรณ์ของใช้และเครื่องมือทางการแพทย์'),
('11', 'ค่าทำหัตถการและวิสัญญี'),
('12', 'ค่าบริการทางการพยาบาล'),
('13', 'ค่าบริการทางทันตกรรม'),
('14', 'ค่าบริการทางกายภาพบำบัดและทางเวชกรรมฟื้นฟู'),
('15', 'ค่าบริการฝังเข็มและค่าบริการการให้การบำบัดของผู้ประกอบโรคศิลปะอื่น'),
('16', 'ค่าบริการอื่นๆที่ไม่เกี่ยวกับการรักษาพยาบาลโดยตรง'),
('17', 'ยานอกบัญชีหลักแห่งชาติ'),
('18', 'ค่าธรรมเนียมทางการแพทย์');

SET FOREIGN_KEY_CHECKS=1;
